uploads/customers/123/supportdesk/AdvancedShipNotice-Store.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://wservice.rtt.co.za/ws_DEMO/">
   <soapenv:Header/>
   <soapenv:Body>
      <AdvancedShipNotice>
         <advancedShipNotice>
            <ExternReceiptKey>6000141628_1</ExternReceiptKey>
            <ExternReceiptKey2>6000</ExternReceiptKey2>
            <Sku/>
            <Type>2</Type>
            <StorerKey>6000</StorerKey>
            <containerkey>6000141628_1</containerkey>
            <ASNDetails>
               <structAdvancedShipNoticeDetails>
                  <Sku>1001690001001</Sku>
                  <QtyExpected>96</QtyExpected>
                  <PackKey/>
                  <POLineNumber/>
                  <AltSku/>
                  <POKey/>
                  <GrossWgt>0</GrossWgt>
                  <ExternLineNo>1</ExternLineNo>
                  <UOM>EA</UOM>
                  <SUSR1/>
                  <SUSR2/>
                  <SUSR3/>
                  <StorerKey>6000</StorerKey>
                  <ToLoc/>
               </structAdvancedShipNoticeDetails>
               <structAdvancedShipNoticeDetails>
                  <Sku>1010439001001</Sku>
                  <QtyExpected>180</QtyExpected>
                  <PackKey/>
                  <POLineNumber/>
                  <AltSku/>
                  <POKey/>
                  <GrossWgt>0</GrossWgt>
                  <ExternLineNo>2</ExternLineNo>
                  <UOM>EA</UOM>
                  <SUSR1/>
                  <SUSR2/>
                  <SUSR3/>
                  <StorerKey>6000</StorerKey>
                  <ToLoc/>
               </structAdvancedShipNoticeDetails>
            </ASNDetails>
         </advancedShipNotice>
      </AdvancedShipNotice>
   </soapenv:Body>
</soapenv:Envelope>